In [1]:
# five pandas function 
# 1. pd.read_csv("players.csv")
# 2. pd.Series()
# 3. pd.Categorical()
# 4. pd.DataFrame()
# 5. pd.date_range(start='' , end= '')

In [3]:
import pandas as pd
pd.Series([1,2,3,4] , index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
# pd.DataFrame()

In [5]:
# q.02
dic = {'a':[1,2,3,4,5],
       'b':[6,7,8,9,10],
       'c':[11,12,13,14,15]
      }
df = pd.DataFrame(dic)

In [7]:
df['index'] = [1,3,5,7,9]

In [9]:
df.set_index('index')

       a   b   c
index
1      1   6  11
3      2   7  12
5      3   8  13
7      4   9  14
9      5  10  15

In [11]:
df1 = pd.DataFrame({'values':[10,20,30,40,50]})

In [12]:
df1

   values
0      10
1      20
2      30
3      40
4      50

In [15]:
df1.loc[:2,['values'] ].sum()

values    60
dtype: int64

In [16]:
df1[0:3].sum()

values    60
dtype: int64

In [17]:
df2 = pd.DataFrame({'text':['my name is subh' , 'am a stud' , 'too sexy']})

In [18]:
df2

              text
0  my name is subh
1        am a stud
2         too sexy

In [19]:
def func(x):
    return len(x.split())
df2["word_count"] = df2['text'].apply(func)

In [20]:
df2

              text  word_count
0  my name is subh           4
1        am a stud           3
2         too sexy           2

In [23]:
df3 = pd.DataFrame({'A':[3,8,6,2,9],
                    'B':[5,2,9,3,1],
                    'C':[1,7,4,5,2]})

In [24]:
df3

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [26]:
df4 = df3[(df3['A']>5) & (df3['B']<10)]

In [27]:
df4

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [28]:
df5 = pd.DataFrame({'date' :['2023-05-19','2023-05-18','2023-05-17']})

In [29]:
df5

         date
0  2023-05-19
1  2023-05-18
2  2023-05-17

In [30]:
df5['updated_date']= pd.to_datetime(df5['date'])

In [31]:
df5

         date updated_date
0  2023-05-19   2023-05-19
1  2023-05-18   2023-05-18
2  2023-05-17   2023-05-17

In [34]:
df5['weekday']= df5['updated_date'].dt.

In [35]:
df5

         date updated_date  weekday
0  2023-05-19   2023-05-19        4
1  2023-05-18   2023-05-18        3
2  2023-05-17   2023-05-17        2